tap "felixkratz/formulae"
tap "joshmedeski/sesh"
tap "steipete/tap"
tap "weaveworks/tap"
brew "xz"
brew "openssl@3"
brew "node"
brew "appium"
brew "cloc"
brew "cmake"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git-lfs"
brew "helm"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "nvm"
brew "openjdk@21"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "re2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "stern"
brew "terminal-notifier"
brew "tmux"
brew "uv"
brew "watch"
brew "wget"
brew "x-cmd"
brew "z"
brew "felixkratz/formulae/sketchybar"
brew "joshmedeski/sesh/sesh"
brew "weaveworks/tap/eksctl"
cask "1password-cli"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"
cask "steipete/tap/codexbar"
cask "font-hack-nerd-font"
cask "font-maple-mono-nf-cn"
cask "kubecontext"
vscode "catppuccin.catppuccin-vsc"
vscode "highagency.pencildev"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "nparamonov.cold-python-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
